Revit 2027 API
ExporterIFCUtils.CreateProjectLevelGUID Method
 Creates a GUID from Revit project for given GUIDType.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CreateProjectLevelGUID(
	Document document,
	IFCProjectLevelGUIDType guidType
)
Public Shared Function CreateProjectLevelGUID (
	document As Document,
	guidType As IFCProjectLevelGUIDType
) As String
public:
static String^ CreateProjectLevelGUID(
	Document^ document,
	IFCProjectLevelGUIDType guidType
)
static member CreateProjectLevelGUID :
        document : Document *
        guidType : IFCProjectLevelGUIDType -> string
Parameters
document Document
 The document.
guidType IFCProjectLevelGUIDType
 The GUID type.
Return Value
String
 The guid string.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace